app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE (1) LIMIT 1
---
	def edit
		@post = Post.find_by(params[:id])